[
    {
        "title": "The Flaming Lute",
        "description": "Agnibina is a collection of poems by Kazi Nazrul Islam. In this collection, he composed poems on various subjects such as war, love, the sorrows and joys of life, etc. The word Agnibina is composed of agni (fire) and bina (stringed musical instrument), which symbolizes the themes of war and love, as depicted in Nazrul's poems. This collection includes many poems that discuss his established art and activities. Among them are Bidrohi (The Rebel), Rukmini, Bijoy Geeti (The Song of Victory), etc., which vividly reflect his leadership in literary activism. Agnibina is an invaluable part of Kazi Nazrul Islam's literary journey and remains an incomplete fruition of his long career.",
        "writer": "Kazi Nazrul Islam ",
        "category": "Poetry",
        "language": "Bangla",
        "pages": 104,
        "price": 200,
        "publisher": "Goodreads",
        "edition": "First Edition",
        "owner_email": "admin88@gmail.com",
        "stock_limit": 12,
        "upload_time": "2023-11-05T08:45:00.000Z",
        "avg_rating": 4.5,
        "cover_image": "https://i.ibb.co/tCyqygC/by-Kazi-Nazrul-Islam.jpg"
    },
    {
        "title": "Bhumika: Rabindranath Tagore",
        "description": "Introduction: Rabindranath Tagore - This book serves as an introduction and critique of Rabindranath Tagore's life, works, and literary contributions. It discusses various aspects of his life, literary journey, and the role he played in social service. Additionally, it emphasizes on his literary works, which were intricately linked with his philosophy, spirituality, and contribution to social discourse.",
        "writer": "Rabindranath Tagore ",
        "category": "Poetry",
        "language": "Bangla",
        "pages": 154,
        "price": 300,
        "publisher": "Flipkart",
        "edition": "Second Edition",
        "owner_email": "admin88@gmail.com",
        "stock_limit": 9,
        "upload_time": "2023-11-05T08:45:00.000Z",
        "avg_rating": 4.5,
        "cover_image": "https://i.ibb.co/mt7XxGd/Bhumika-Rabindranath-Tagore-1f403-175385.jpg"
    },
    {
        "title": "Boshonto Bilash",
        "description": "Boshonto Bilash is a novel by the renowned Bangladeshi author Humayun Ahmed. The title translates to Spring Delight in English. The novel revolves around the lives of its characters against the backdrop of spring, symbolizing renewal, hope, and the vibrant colors of nature. Humayun Ahmed masterfully weaves together various elements such as love, family dynamics, societal issues, and the human condition. The narrative is rich with humor, warmth, and emotional depth, drawing readers into the intricacies of the characters' relationships and their journey through life. Boshonto Bilash is not just a story; it is a reflection of the joys and challenges of existence, presented through Ahmed's distinctive storytelling styl",
        "writer": "Humayun Ahmed",
        "category": "Poetry",
        "language": "Bangla",
        "pages": 124,
        "price": 250,
        "publisher": "Mina Book",
        "edition": "First Edition",
        "owner_email": "admin88@gmail.com",
        "stock_limit": 15,
        "upload_time": "2023-11-05T08:45:00.000Z",
        "avg_rating": 4.4,
        "cover_image": "https://i.ibb.co/FmGSGB7/poetry-humain-ahmed.jpg"
    },
    {
        "title": "A Brief History of Time",
        "description": "A Brief History of Time by Stephen Hawking is a popular science book that explores various concepts in cosmology, such as the Big Bang theory, black holes, the nature of time, and the universe's origins and eventual fate. Hawking presents these complex ideas in a simplified manner accessible to a general audience, making it one of the most famous science books of the 20th century.",
        "writer": "Stephen Hawking",
        "category": "Science",
        "language": "English",
        "pages": 400,
        "price": 200,
        "publisher": "Hoq Book",
        "edition": "Second Edition",
        "owner_email": "admin88@gmail.com",
        "stock_limit": 10,
        "upload_time": "2023-11-05T08:45:00.000Z",
        "avg_rating": 4.5,
        "cover_image": "https://i.ibb.co/ngGgJSZ/Brief-History-Time.jpg"
    },
    {
        "title": "The Structure of Scientific Revolutions",
        "description": "The Structure of Scientific Revolutions by Thomas S. Kuhn is a seminal work in the philosophy of science. In it, Kuhn introduces the concept of paradigm shifts, arguing that scientific progress does not always occur through gradual accumulation of knowledge, but rather through revolutionary changes in fundamental scientific assumptions and perspectives. Kuhn's book sparked significant debate and reshaped the way scholars think about the nature of scientific advancement.",
        "writer": "Thomas S. Kuhn",
        "category": "Science",
        "language": "English",
        "pages": 170,
        "price": 350,
        "publisher": "Goodreads",
        "edition": "Second Edition",
        "owner_email": "admin88@gmail.com",
        "stock_limit": 6,
        "upload_time": "2023-11-05T08:45:00.000Z",
        "avg_rating": 4.5,
        "cover_image": "https://i.ibb.co/qyrb72s/The-Structure-of-Scientific-Revolutions.jpg"
    },
    {
        "title": "The Sixth Extinction: An Unnatural History",
        "description": "The Sixth Extinction: An Unnatural History by Elizabeth Kolbert is a compelling exploration of the ongoing mass extinction event caused by human activities. Kolbert investigates the historical precedents of previous extinction events and examines how contemporary factors such as habitat destruction, climate change, and invasive species are driving a new wave of biodiversity loss. Through vivid storytelling and rigorous scientific research, she highlights the urgent need for conservation efforts to mitigate the devastating consequences of human-induced extinction.",
        "writer": "Elizabeth Kolbert",
        "category": "Science",
        "language": "English",
        "pages": 170,
        "price": 400,
        "publisher": "Macmillan",
        "edition": "First Edition",
        "owner_email": "admin88@gmail.com",
        "stock_limit": 10,
        "upload_time": "2023-11-05T08:45:00.000Z",
        "avg_rating": 4.5,
        "cover_image": "https://i.ibb.co/7zYL6Gr/The-Sixth-Extinction.jpg"
    },
    {
        "title": "The Power of Now",
        "description": "The Power of Now by Eckhart Tolle is a spiritual guidebook published in 1997. It emphasizes the importance of living in the present moment and letting go of past regrets and future anxieties. Tolle draws from various spiritual traditions, including Buddhism and Christianity, to present his teachings on mindfulness and consciousness. The book explores how individuals can break free from the cycle of negative thinking and ego identification by focusing on the present moment. Tolle argues that true happiness and enlightenment can only be found by fully embracing the Now.",
        "writer": "Eckhart Tolle",
        "category": "Self-help",
        "language": "English",
        "pages": 224,
        "price": 550,
        "publisher": "namastepublishing",
        "edition": "First Edition",
        "owner_email": "admin88@gmail.com",
        "stock_limit": 10,
        "upload_time": "2023-11-05T08:45:00.000Z",
        "avg_rating": 4.5,
        "cover_image": "https://i.ibb.co/cJjGDB5/The-Powerof-Nowby-Eckhart-Tolle.jpg"
    },
    {
        "title": "Think and Grow Rich",
        "description": "Think and Grow Rich by Napoleon Hill is a classic self-help book originally published in 1937. It is widely regarded as one of the greatest personal development and success books of all time. Hill's work is based on his study of numerous successful individuals, including Andrew Carnegie, Thomas Edison, Henry Ford, and other prominent figures of his timem The book outlines Hill's philosophy on achieving success and prosperity through the power of thought and visualization. It emphasizes the importance of setting clear goals, developing a burning desire to achieve them, and maintaining a positive mental attitude. Hill introduces the concept of the Law of Attraction, suggesting that thoughts have the power to attract success or failure into one's life.",
        "writer": "Napoleon Hill",
        "category": "Self-help",
        "language": "English",
        "pages": 204,
        "price": 350,
        "publisher": "Mina Book",
        "edition": "Third Edition",
        "owner_email": "admin88@gmail.com",
        "stock_limit": 100,
        "upload_time": "2023-11-05T08:45:00.000Z",
        "avg_rating": 4.7,
        "cover_image": "https://i.ibb.co/3C0882j/theandgroerich.jpg"
    },
    {
        "title": "Mindset: The New Psychology of Success",
        "description": "Mindset: The New Psychology of Success by Carol S. Dweck, published in 2006, explores the concept of mindset and its impact on achievement, resilience, and personal development. Dweck, a renowned psychologist, introduces the idea of two main mindsets: the fixed mindset and the growth mindset. In the book, Dweck explains that individuals with a fixed mindset believe that their abilities and intelligence are fixed traits, and they tend to avoid challenges, give up easily in the face of obstacles, and see effort as fruitless. On the other hand, those with a growth mindset believe that their abilities can be developed through dedication and hard work. They embrace challenges, persist in the face of setbacks, and view effort as a path to mastery.",
        "writer": "Carol S. Dweck",
        "category": "Self-help",
        "language": "English",
        "pages": 180,
        "price": 400,
        "publisher": "Goodreads",
        "edition": "First Edition",
        "owner_email": "admin88@gmail.com",
        "stock_limit": 20,
        "upload_time": "2023-11-05T08:45:00.000Z",
        "avg_rating": 4.5,
        "cover_image": "https://i.ibb.co/F3yMLpz/mindset.jpg"
    },
    {
        "title": "The Beach",
        "description": "The Beach is a novel written by Alex Garland that follows the journey of a young backpacker named Richard as he travels through Thailand in search of adventure and escape from the conventional world. Upon hearing about a hidden paradise, a secluded beach untouched by tourism, Richard becomes obsessed with finding it. Along with a French couple, he discovers the hidden beach community led by a charismatic and enigmatic figure named Sal. However, the idyllic paradise soon reveals its dark underbelly as tensions rise within the community. The novel explores themes of adventure, self-discovery, the allure of paradise, and the consequences of idealism.",
        "writer": "Alex Garland",
        "category": "Travel",
        "language": "English",
        "pages": 150,
        "price": 300,
        "publisher": "Macmillan",
        "edition": "Third Edition",
        "owner_email": "admin88@gmail.com",
        "stock_limit": 5,
        "upload_time": "2023-11-05T08:45:00.000Z",
        "avg_rating": 4.8,
        "cover_image": "https://i.ibb.co/NZDPd2q/theBeach.jpg"
    },
    {
        "title": "The Art of Travel",
        "description": "The Art of Travel by Alain de Botton is a philosophical exploration of the pleasures and perils of travel. De Botton delves into the psychology of travel, examining why we travel, what we seek to find, and how our expectations often differ from reality. Drawing on personal anecdotes, historical anecdotes, and the works of famous artists and writers, de Botton reflects on the transformative power of travel and the ways in which it can enrich our lives. The book encourages readers to approach travel with a mindful and introspective perspective, seeking not only to escape from our daily routines but also to gain a deeper understanding of ourselves and the world around us.",
        "writer": "Alain de Botton",
        "category": "Travel",
        "language": "English",
        "pages": 120,
        "price": 250,
        "publisher": "Blinkist",
        "edition": "First Edition",
        "owner_email": "admin88@gmail.com",
        "stock_limit": 30,
        "upload_time": "2023-11-05T08:45:00.000Z",
        "avg_rating": 4.5,
        "cover_image": "https://i.ibb.co/mqx6ZST/the-Arthwebp.webp"
    },
    {
        "title": "Megher Oporé",
        "description": "Megher Oporé is a novel by renowned Bangladeshi author Humayun Ahmed. The title translates to Beyond the Clouds in English. The story revolves around the life of an ordinary man named Ruhul Amin. Ruhul Amin is a middle-aged man who leads a monotonous life until he embarks on a journey of self-discovery. The narrative unfolds as Ruhul Amin travels from his mundane existence to the enchanting hill town of Sylhet, where he encounters various characters and experiences that challenge his perceptions and beliefs. Through his journey, Ruhul Amin reflects on the complexities of human relationships, the passage of time, and the pursuit of happiness. Humayun Ahmed skillfully weaves together elements of romance, philosophy, and humor, making Megher Oporé a compelling read that resonates with readers of all ages. ",
        "writer": "Humayun Ahmed",
        "category": "Travel",
        "language": "English",
        "pages": 100,
        "price": 180,
        "publisher": "Mina Book",
        "edition": "Second Edition",
        "owner_email": "admin88@gmail.com",
        "stock_limit": 8,
        "upload_time": "2023-11-05T08:45:00.000Z",
        "avg_rating": 4.5,
        "cover_image": "https://i.ibb.co/CJQv2Rt/megaroper.jpg"
    }
]