[
    {
        "title": "Clean Code: A Handbook of Agile Software Craftsmanship",
        "writer": "Robert C. Martin",
        "description": "Clean Code: A Handbook of Agile Software Craftsmanship by Robert C. Martin provides practical advice on writing clean and maintainable code for software developers. The book, published in 2008 by Prentice Hall, is available in print format as a paperback. With dimensions of 9.2 x 7.3 x 1.2 inches, it has 464 pages. The book, known for its emphasis on programming best practices, covers topics like programming, clean code, and Agile methodologies. The owner, SoftwareDevPro, is located in San Francisco, United States. The exchange status is available, and the condition is excellent. For more details, contact softwaredevpro@gmail.com. The phone number is +454555565565. The location is San Francisco, 789 Code Lane, 94105.",
        "publication_year": 2008,
        "edition": "First Edition",
        "language": "English",
        "publisher": "Prentice Hall",
        "format": "Print",
        "cover_type": "Paperback",
        "pages": 464,
        "cover_image": "https://i.ibb.co/6wC3hfL/Clean-Code.jpg",
        "condition": "Excellent",
        "category": "Programming",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    },
    {
        "title": "Code Complete: A Practical Handbook of Software Construction",
        "writer": "Steve McConnell",
        "description": "Code Complete: A Practical Handbook of Software Construction by Steve McConnell is a valuable resource offering practical advice on software construction and coding techniques. Published in 1993 by Microsoft Press, this second edition book is available in print format as a hardcover. The dimensions are 9.4 x 7.7 x 2.1 inches, and it comprises 960 pages. Covering topics such as software construction and coding techniques, this book is a must-read for serious software developers. The owner, CodeWizard, is based in Redmond, United States. The exchange status is available, and the condition is very good. For inquiries, contact codewizard@gmail.com. The phone number is +454555565566. The location is Redmond, 123 Code Avenue, 98052.",
        "publication_year": 1993,
        "edition": "Second Edition",
        "language": "English",
        "publisher": "Microsoft Press",
        "format": "Print",
        "cover_type": "Hardcover",
        "pages": 960,
        "cover_image": "https://i.ibb.co/1TYbFYN/Code-Complete.jpg",
        "condition": "Very Good",
        "category": "Programming",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    },
    {
        "title": "Design Patterns: Elements of Reusable Object-Oriented Software",
        "writer": "Erich Gamma, Richard Helm, Ralph Johnson, John Vlissides",
        "description": "Design Patterns: Elements of Reusable Object-Oriented Software is a classic book that introduces fundamental design patterns for object-oriented software development. Written by Erich Gamma, Richard Helm, Ralph Johnson, and John Vlissides, the book was published in 1994 by Addison-Wesley. It is available in print format as a hardcover with dimensions of 9.0 x 7.3 x 1.0 inches and 416 pages. The book covers design patterns, object-oriented software, and software development. The owner, DesignCraftsman, is located in New York, United States. The exchange status is available, and the condition is like new. For inquiries, contact designcraftsman@gmail.com. The phone number is +454555565567. The location is New York, 789 Design Street, 10001.",
        "publication_year": 1994,
        "edition": "First Edition",
        "language": "English",
        "publisher": "Addison-Wesley",
        "format": "Print",
        "cover_type": "Hardcover",
        "pages": 416,
        "cover_image": "https://i.ibb.co/2NhKDmN/Design-Patterns.jpg",
        "condition": "Like New",
        "category": "Science",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    },
    {
        "title": "The Pragmatic Programmer: Your Journey to Mastery",
        "writer": "Dave Thomas, Andy Hunt",
        "description": "The Pragmatic Programmer: Your Journey to Mastery by Dave Thomas and Andy Hunt is a book that provides practical tips and techniques for becoming a more effective and efficient programmer. Published in 1999 by Addison-Wesley, the book is available in print format as a paperback. With dimensions of 9.1 x 7.4 x 1.0 inches, it has 352 pages. The book covers topics like pragmatic programming and software development. The owner, PragmaticCoder, is located in Austin, United States. The exchange status is available, and the condition is excellent. For inquiries, contact pragmaticcoder@gmail.com. The phone number is +454555565568. The location is Austin, 456 Pragmatic Lane, 78701.",
        "publication_year": 1999,
        "edition": "First Edition",
        "language": "English",
        "publisher": "Addison-Wesley",
        "format": "Print",
        "cover_type": "Paperback",
        "pages": 352,
        "cover_image": "https://i.ibb.co/tXcTBJt/The-Pragmatic-Programmer.jpg",
        "condition": "Excellent",
        "category": "Programming",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    },
    {
        "title": "Structure and Interpretation of Computer Programs",
        "writer": "Harold Abelson, Gerald Jay Sussman, Julie Sussman",
        "description": "Structure and Interpretation of Computer Programs is an influential book that introduces fundamental concepts in computer programming and software design. Written by Harold Abelson, Gerald Jay Sussman, and Julie Sussman, the book was published in 1985 by MIT Press. It is available in print format as a paperback with dimensions of 9.1 x 7.3 x 1.4 inches and 657 pages. The book covers computer programming and software design. The owner, CodePhilosopher, is located in Cambridge, United States. The exchange status is available, and the condition is good. For inquiries, contact codephilosopher@gmail.com. The phone number is +454555565569. The location is Cambridge, 789 Programming Avenue, 02139.",
        "publication_year": 1985,
        "edition": "First Edition",
        "language": "English",
        "publisher": "MIT Press",
        "format": "Print",
        "cover_type": "Paperback",
        "pages": 657,
        "cover_image": "https://i.ibb.co/7vLVVKg/Structure-and-Interpretation-of-Computer-Programs-1.jpg",
        "condition": "Good",
        "category": "Science",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    },
    {
        "title": "Introduction to Algorithms",
        "writer": "Thomas H. Cormen, Charles E. Leiserson, Ronald L. Rivest, Clifford Stein",
        "description": "Introduction to Algorithms is a comprehensive guide to the design and analysis of algorithms. Authored by Thomas H. Cormen, Charles E. Leiserson, Ronald L. Rivest, and Clifford Stein, this book covers a wide range of topics including algorithms, data structures, and complexity analysis. Published in 1990 by The MIT Press, this book is available in print format as a hardcover. With dimensions of 9.5 x 7.5 x 2.3 inches, it contains 1312 pages. The owner, AlgorithmMaster, is located in Boston, United States. The exchange status is available, and the condition is very good. For inquiries, contact algorithmmaster@gmail.com. The phone number is +454555565570. The location is Boston, 123 Algorithm Street, 02142.",
        "publication_year": 1990,
        "edition": "Third Edition",
        "language": "English",
        "publisher": "The MIT Press",
        "format": "Print",
        "cover_type": "Hardcover",
        "pages": 1312,
        "cover_image": "https://i.ibb.co/brnGt89/Introduction-to-Algorithms.jpg",
        "condition": "Very Good",
        "category": "Programming",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    },
    {
        "title": "Operating System Concepts",
        "writer": "Abraham Silberschatz, Peter Baer Galvin, Greg Gagne",
        "description": "Operating System Concepts is a widely used textbook that covers fundamental concepts in operating systems. Authored by Abraham Silberschatz, Peter Baer Galvin, and Greg Gagne, this book provides an in-depth understanding of operating system principles and design. Published by Wiley in 1989, this ninth edition book is available in print format as a hardcover. It has dimensions of 9.3 x 7.4 x 1.6 inches and consists of 976 pages. The owner, OSExpert, is located in Chicago, United States. The exchange status is available, and the condition is excellent. For inquiries, contact osexpert@gmail.com. The phone number is +454555565571. The location is Chicago, 456 OS Street, 60607.",
        "publication_year": 1989,
        "edition": "Ninth Edition",
        "language": "English",
        "publisher": "Wiley",
        "format": "Print",
        "cover_type": "Hardcover",
        "pages": 976,
        "cover_image": "https://i.ibb.co/wMgXk6z/Operating-System-Concepts.jpg",
        "condition": "Excellent",
        "category": "Programming",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    },
    {
        "title": "Computer Networking: A Top-Down Approach",
        "writer": "James F. Kurose, Keith W. Ross",
        "description": "Computer Networking: A Top-Down Approach is a comprehensive book that provides an introduction to computer networks. Written by James F. Kurose and Keith W. Ross, this book covers various aspects of computer networking including protocols, architecture, and applications. Published by Pearson in 2000, this seventh edition book is available in print format as a hardcover. It measures 9.4 x 7.7 x 1.4 inches and contains 864 pages. The owner, NetworkExpert, is located in Seattle, United States. The exchange status is available, and the condition is like new. For inquiries, contact networkexpert@gmail.com. The phone number is +454555565572. The location is Seattle, 789 Network Street, 98101.",
        "publication_year": 2000,
        "edition": "Seventh Edition",
        "language": "English",
        "publisher": "Pearson",
        "format": "Print",
        "cover_type": "Hardcover",
        "pages": 864,
        "cover_image": "https://i.ibb.co/wCQ8dnp/Computer-Networking.jpg",
        "condition": "Like New",
        "category": "Programming",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    },
    {
        "title": "Artificial Intelligence: A Modern Approach",
        "writer": "Stuart Russell, Peter Norvig",
        "description": "Artificial Intelligence: A Modern Approach is a leading textbook in the field of artificial intelligence (AI). Written by Stuart Russell and Peter Norvig, this book covers a wide range of AI topics including intelligent agents, problem-solving, and machine learning. Published by Pearson in 1995, this third edition book is available in print format as a hardcover. It has dimensions of 9.2 x 7.4 x 2.1 inches and consists of 1152 pages. The owner, AIOwner, is located in San Francisco, United States. The exchange status is available, and the condition is very good. For inquiries, contact aiowner@gmail.com. The phone number is +454555565573. The location is San Francisco, 123 AI Street, 94105.",
        "publication_year": 1995,
        "edition": "Third Edition",
        "language": "English",
        "publisher": "Pearson",
        "format": "Print",
        "cover_type": "Hardcover",
        "pages": 1152,
        "cover_image": "https://i.ibb.co/0YmDL38/Artificial-Intelligence.jpg",
        "condition": "Very Good",
        "category": "Science",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    },
    {
        "title": "Database Management Systems",
        "writer": "Raghu Ramakrishnan, Johannes Gehrke",
        "description": "Database Management Systems provides a comprehensive introduction to the principles and practices of database systems. Authored by Raghu Ramakrishnan and Johannes Gehrke, this book covers topics such as relational databases, SQL, and transaction management. Published by McGraw-Hill in 2000, this third edition book is available in print format as a hardcover. It measures 9.1 x 7.3 x 1.7 inches and contains 1136 pages. The owner, DBExpert, is located in New York, United States. The exchange status is available, and the condition is excellent. For inquiries, contact dbexpert@gmail.com. The phone number is +454555565574. The location is New York, 456 Database Street, 10001.",
        "publication_year": 2000,
        "edition": "Third Edition",
        "language": "English",
        "publisher": "McGraw-Hill",
        "format": "Print",
        "cover_type": "Hardcover",
        "pages": 1136,
        "cover_image": " https://i.ibb.co/f1JbCCn/Database-Management-Systems.jpg",
        "condition": "Excellent",
        "category": "Programming",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    },
    {
        "title": "Rosemary and Rue",
        "writer": "Seanan McGuire",
        "description": "Rosemary and Rue is the first book in the October Daye series written by Seanan McGuire. This urban fantasy novel introduces readers to Toby Daye, a half-human, half-faerie private investigator with a tumultuous past. The story unfolds in the mysterious and magical streets of San Francisco, where Toby finds herself drawn back into the faerie world she had desperately tried to leave behind. When a powerful curse transforms her into a fish for fourteen years, Toby emerges to discover that her world has changed, and her loved ones have moved on without her. As she navigates the complex politics of the faerie courts and investigates a friend's murder, Toby becomes entangled in a web of ancient rivalries and dark secrets.",
        "publication_year": 2008,
        "edition": "First Edition",
        "language": "English",
        "publisher": "Prentice Hall",
        "format": "Print",
        "cover_type": "Paperback",
        "pages": 464,
        "cover_image": "https://i.ibb.co/LRtZNFg/51-B-W8m-Ji-RL-SY445-SX342.jpg",
        "condition": "Excellent",
        "category": "Thriller",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    },
    {
        "title": "Code Complete: A Practical Handbook of Software Construction",
        "writer": "Dying of the light",
        "description": "A whisperjewel from Gwen Delvano calls Dirk t'Larien across space and beyond the Tempter's Veil to Worlorn, a dying Festival planet of rock and ice. Warlorn is slowly drifting through twilight to neverending night; as the planet sinks into darkness, so its inhabitants face annihilation.Seven years ago, on Avalon, Gwen was Dirk's lover, his Guenevere; now she wears the jade-and-silver bond of Jaantony Riv Wolf high-Ironjade Vikary, a barbarian visionary, an outcast from his own people for his acts of violence. And Garse Janacek, Jaan's *teyn*, his shieldmate, is also bound to Gwen - in hatred. Dirk, a rogue and a wanderer, is called to be saviour of the three who are bonded together in love and hate.But in breaking their triangle, he could lose all.",
        "publication_year": 1993,
        "edition": "Second Edition",
        "language": "English",
        "publisher": "Microsoft Press",
        "format": "Print",
        "cover_type": "Hardcover",
        "pages": 960,
        "cover_image": "https://i.ibb.co/B4yxyYS/9-Books-With-Titles-Inspired-By-Other-Works-Of-Literature-04.png",
        "condition": "Very Good",
        "category": "Programming",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    },
    {
        "title": "The Stars Tennis Balls",
        "writer": "Stephen Fry",
        "description": "Ned Maddstone is good-looking, popular, athletic, and is expected to follow his father into politics. Things take a turn when a chance prank goes horribly wrong, with Ned ending up in a mental asylum. The mental asylum proves to be another tragedy as Neds memories are reconstructed. But Ned vows to return to exact deadly revenge on the ones who wronged him. Stephen Frys psychological thriller, based on The Count Of Monte Cristo, with its title taken from John Websters The Duchess Of Malfi, is a roller coaster ride of its own.",
        "publication_year": 1994,
        "edition": "First Edition",
        "language": "English",
        "publisher": "Addison-Wesley",
        "format": "Print",
        "cover_type": "Hardcover",
        "pages": 416,
        "cover_image": "https://i.ibb.co/cTWbKQR/9-Books-With-Titles-Inspired-By-Other-Works-Of-Literature-08.png",
        "condition": "Like New",
        "category": "Self-help",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    },
    {
        "title": "The Doors Of Perception",
        "writer": "Aldous Huxley",
        "description": "On May 03, 1953, Dr. Humphry Osmond arrived at Aldous Huxleys house to administer mescaline, a psychedelic drug, to the author. Huxleys experiences during that day form the philosophical essay that is The Doors Of Perception. Huxleys drugged state leads him to experience many insights into art, science and religion, and is a direct metaphor to William Blakes comment in The Marriage Of Heaven And Hell If the doors of perception were cleansed every thing would appear to man as it is, Infinite. The title of Huxleys book is also inspired by the same book by Blake, and it is a profound read one that should be read at least once in a lifetime.",
        "publication_year": 2015,
        "edition": "First Edition",
        "language": "English",
        "publisher": "Addison-Wesley",
        "format": "Print",
        "cover_type": "Paperback",
        "pages": 352,
        "cover_image": "https://i.ibb.co/6Djxh04/9-Books-With-Titles-Inspired-By-Other-Works-Of-Literature-03.png",
        "condition": "Excellent",
        "category": "Biography",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    },
    {
        "title": "Book of Night",
        "writer": "Holly Black",
        "description": "Charlie Hall has never found a lock she couldnt pick, a book she couldnt steal, or a bad decision she wouldnt make. She's spent half her life working for gloamists, magicians who manipulate shadows to peer into locked rooms, strangle people in their beds, or worse. Gloamists guard their secrets greedily, creating an underground economy of grimoires. And to rob their fellow magicians, they need Charlie Hall. Now, shes trying to distance herself from past mistakes, but getting out isnt easy. Bartending at a dive, shes still entirely too close to the corrupt underbelly of the Berkshires. Not to mention that her sister Posey is desperate for magic, and that Charlie's shadowless, and possibly soulless, boyfriend has been hiding things from her. When a terrible figure from her past returns, Charlie descends into a maelstrom of murder and lies. Determined to survive, shes up against a cast of doppelgangers, mercurial billionaires, gloamists, and the people she loves best in the world—all trying to steal a secret that will give them vast and terrible power.",
        "publication_year": 2000,
        "edition": "First Edition",
        "language": "English",
        "publisher": "MIT Press",
        "format": "Print",
        "cover_type": "Paperback",
        "pages": 657,
        "cover_image": "https://i.ibb.co/0nXmmVM/9781250812209.jpg",
        "condition": "Good",
        "category": "Thriller",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    },
    {
        "title": "The Book of All Books",
        "writer": "Roberto Calassos",
        "description": "Roberto Calassos The Book of All Books is a narration that moves through the Bible as if through a forest, where every branch—every verse—may offer some revelation. Where a man named Saul becomes the first king of a people because his father sent him off to search for some donkeys that had gone astray. Where, in answer to an invitation from Jerusalems king, the queen of a remote African realm spends three years leading a long caravan of young men, girls dressed in purple, and animals, and with large quantities of spices, to ask the king certain questions. And where a man named Abraham hears these words from a divine voice: “Go away from your land, from your country and from the house of your father toward the land that I will show you”—words that reverberate throughout the Bible, a story about a separation and a promise followed by many other separations and promises.",
        "publication_year": 1990,
        "edition": "Third Edition",
        "language": "English",
        "publisher": "The MIT Press",
        "format": "Print",
        "cover_type": "Hardcover",
        "pages": 1312,
        "cover_image": "https://i.ibb.co/R2zLRTr/9780374601898.jpg",
        "condition": "Very Good",
        "category": "History",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    },
    {
        "title": "Absolution",
        "writer": "Alice McDermott",
        "description": "American women—American wives—have been mostly minor characters in the literature of the Vietnam War, but in Absolution they take center stage. Tricia is a shy newlywed, married to a rising attorney on loan to navy intelligence. Charlene is a practiced corporate spouse and mother of three, a beauty and a bully. In Saigon in 1963, the two women form a wary alliance as they balance the eras mandate to be “helpmeets” to their ambitious husbands with their own inchoate impulse to “do good” for the people of Vietnam. Sixty years later, Charlenes daughter, spurred by an encounter with an aging Vietnam vet, reaches out to Tricia. Together, they look back at their time in Saigon, taking wry account of that pivotal year and of Charlenes altruistic machinations, and discovering how their own lives as women on the periphery—of politics, of history, of war, of their husbands convictions—have been shaped and burdened by the same sort of unintended consequences that followed Americas tragic interference in Southeast Asia.",
        "publication_year": 1989,
        "edition": "Ninth Edition",
        "language": "English",
        "publisher": "Wiley",
        "format": "Print",
        "cover_type": "Hardcover",
        "pages": 976,
        "cover_image": "https://i.ibb.co/SJFKtyv/9780374610494.jpg",
        "condition": "Excellent",
        "category": "Non-fiction",
        "exchange_status": "available",
        "owner_email": "user@gmail.com"
    }
]